


List<Map<String,dynamic>> governorates=[
  {
    "id": 15,
    "name": "اسوان"
  },
  {
    "id": 16,
    "name": "اسيوط"
  },
  {
    "id": 3,
    "name": "الأسكندرية"
  },
  {
    "id": 24,
    "name": "الأقصر"
  },
  {
    "id": 9,
    "name": "الإسماعلية"
  },
  {
    "id": 5,
    "name": "البحر الأحمر"
  },
  {
    "id": 6,
    "name": "البحيرة"
  },
  {
    "id": 2,
    "name": "الجيزة"
  },
  {
    "id": 4,
    "name": "الدقهلية"
  },
  {
    "id": 14,
    "name": "السويس"
  },
  {
    "id": 20,
    "name": "الشرقية"
  },
  {
    "id": 8,
    "name": "الغربية"
  },
  {
    "id": 7,
    "name": "الفيوم"
  },
  {
    "id": 1,
    "name": "القاهرة"
  },
  {
    "id": 12,
    "name": "القليوبية"
  },
  {
    "id": 10,
    "name": "المنوفية"
  },
  {
    "id": 11,
    "name": "المنيا"
  },
  {
    "id": 13,
    "name": "الوادي الجديد"
  },
  {
    "id": 17,
    "name": "بني سويف"
  },
  {
    "id": 18,
    "name": "بورسعيد"
  },
  {
    "id": 21,
    "name": "جنوب سيناء"
  },
  {
    "id": 19,
    "name": "دمياط"
  },
  {
    "id": 27,
    "name": "سوهاج"
  },
  {
    "id": 26,
    "name": "شمال سيناء"
  },
  {
    "id": 25,
    "name": "قنا"
  },
  {
    "id": 22,
    "name": "كفر الشيخ"
  },
  {
    "id": 23,
    "name": "مطروح"
  }
];



Map<int, dynamic> cities={
  100:[
    {
      "id": 00,
      "name": " "
    },
  ],
  1: [
    {
      "id": 1,
      "name": "15 مايو"
    },
    {
      "id": 2,
      "name": "الازبكية"
    },
    {
      "id": 3,
      "name": "البساتين"
    },
    {
      "id": 4,
      "name": "التبين"
    },
    {
      "id": 53,
      "name": "الجمالية"
    },
    {
      "id": 55,
      "name": "الحلمية"
    },
    {
      "id": 5,
      "name": "الخليفة"
    },
    {
      "id": 6,
      "name": "الدراسة"
    },
    {
      "id": 7,
      "name": "الدرب الاحمر"
    },
    {
      "id": 48,
      "name": "الرحاب"
    },
    {
      "id": 8,
      "name": "الزاوية الحمراء"
    },
    {
      "id": 46,
      "name": "الزمالك"
    },
    {
      "id": 9,
      "name": "الزيتون"
    },
    {
      "id": 10,
      "name": "الساحل"
    },
    {
      "id": 11,
      "name": "السلام"
    },
    {
      "id": 12,
      "name": "السيدة زينب"
    },
    {
      "id": 13,
      "name": "الشرابية"
    },
    {
      "id": 15,
      "name": "الظاهر"
    },
    {
      "id": 54,
      "name": "العاشر من رمضان"
    },
    {
      "id": 57,
      "name": "العاصمة الإدارية"
    },
    {
      "id": 16,
      "name": "العتبة"
    },
    {
      "id": 17,
      "name": "القاهرة الجديدة"
    },
    {
      "id": 49,
      "name": "القطامية"
    },
    {
      "id": 18,
      "name": "المرج"
    },
    {
      "id": 20,
      "name": "المطرية"
    },
    {
      "id": 21,
      "name": "المعادى"
    },
    {
      "id": 22,
      "name": "المعصرة"
    },
    {
      "id": 23,
      "name": "المقطم"
    },
    {
      "id": 24,
      "name": "المنيل"
    },
    {
      "id": 25,
      "name": "الموسكى"
    },
    {
      "id": 26,
      "name": "النزهة"
    },
    {
      "id": 56,
      "name": "النزهة الجديدة"
    },
    {
      "id": 27,
      "name": "الوايلى"
    },
    {
      "id": 28,
      "name": "باب الشعرية"
    },
    {
      "id": 29,
      "name": "بولاق"
    },
    {
      "id": 30,
      "name": "جاردن سيتى"
    },
    {
      "id": 31,
      "name": "حدائق القبة"
    },
    {
      "id": 32,
      "name": "حلوان"
    },
    {
      "id": 33,
      "name": "دار السلام"
    },
    {
      "id": 51,
      "name": "روض الفرج"
    },
    {
      "id": 34,
      "name": "شبرا"
    },
    {
      "id": 52,
      "name": "شيراتون"
    },
    {
      "id": 35,
      "name": "طره"
    },
    {
      "id": 36,
      "name": "عابدين"
    },
    {
      "id": 37,
      "name": "عباسية"
    },
    {
      "id": 19,
      "name": "عزبة النخل"
    },
    {
      "id": 38,
      "name": "عين شمس"
    },
    {
      "id": 47,
      "name": "قصر النيل"
    },
    {
      "id": 14,
      "name": "مدينة الشروق"
    },
    {
      "id": 44,
      "name": "مدينة العبور"
    },
    {
      "id": 43,
      "name": "مدينة بدر"
    },
    {
      "id": 39,
      "name": "مدينة نصر"
    },
    {
      "id": 50,
      "name": "مدينتي"
    },
    {
      "id": 40,
      "name": "مصر الجديدة"
    },
    {
      "id": 41,
      "name": "مصر القديمة"
    },
    {
      "id": 42,
      "name": "منشية ناصر"
    },
    {
      "id": 45,
      "name": "وسط البلد"
    }
  ],
  2: [
    {
      "id": 70,
      "name": "أبو النمرس"
    },
    {
      "id": 86,
      "name": "أبو رواش"
    },
    {
      "id": 64,
      "name": "أطفيح"
    },
    {
      "id": 68,
      "name": "أوسيم"
    },
    {
      "id": 92,
      "name": "ارض اللواء"
    },
    {
      "id": 66,
      "name": "الباويطي"
    },
    {
      "id": 62,
      "name": "البدرشين"
    },
    {
      "id": 58,
      "name": "الجيزة"
    },
    {
      "id": 88,
      "name": "الحرانية"
    },
    {
      "id": 61,
      "name": "الحوامدية"
    },
    {
      "id": 73,
      "name": "الدقى"
    },
    {
      "id": 59,
      "name": "السادس من أكتوبر"
    },
    {
      "id": 60,
      "name": "الشيخ زايد"
    },
    {
      "id": 63,
      "name": "الصف"
    },
    {
      "id": 74,
      "name": "العجوزة"
    },
    {
      "id": 80,
      "name": "العمرانية"
    },
    {
      "id": 65,
      "name": "العياط"
    },
    {
      "id": 91,
      "name": "القرية الذكية"
    },
    {
      "id": 83,
      "name": "الكيت كات"
    },
    {
      "id": 81,
      "name": "المنيب"
    },
    {
      "id": 84,
      "name": "المهندسين"
    },
    {
      "id": 75,
      "name": "الهرم"
    },
    {
      "id": 79,
      "name": "الواحات البحرية"
    },
    {
      "id": 76,
      "name": "الوراق"
    },
    {
      "id": 77,
      "name": "امبابة"
    },
    {
      "id": 78,
      "name": "بولاق الدكرور"
    },
    {
      "id": 82,
      "name": "بين السرايات"
    },
    {
      "id": 89,
      "name": "حدائق اكتوبر"
    },
    {
      "id": 87,
      "name": "حدائق الأهرام"
    },
    {
      "id": 90,
      "name": "صفط اللبن"
    },
    {
      "id": 85,
      "name": "فيصل"
    },
    {
      "id": 69,
      "name": "كرداسة"
    },
    {
      "id": 71,
      "name": "كفر غطاطي"
    },
    {
      "id": 72,
      "name": "منشأة البكاري"
    },
    {
      "id": 67,
      "name": "منشأة القناطر"
    }
  ],
  15: [
    {
      "id": 254,
      "name": "أسوان"
    },
    {
      "id": 255,
      "name": "أسوان الجديدة"
    },
    {
      "id": 260,
      "name": "إدفو"
    },
    {
      "id": 264,
      "name": "ابوسمبل السياحية"
    },
    {
      "id": 262,
      "name": "البصيلية"
    },
    {
      "id": 261,
      "name": "الرديسية"
    },
    {
      "id": 263,
      "name": "السباعية"
    },
    {
      "id": 256,
      "name": "دراو"
    },
    {
      "id": 259,
      "name": "كلابشة"
    },
    {
      "id": 257,
      "name": "كوم أمبو"
    },
    {
      "id": 265,
      "name": "مرسى علم"
    },
    {
      "id": 258,
      "name": "نصر النوبة"
    },
  ],

  16:[
    {
      "id": 271,
      "name": "أبنوب"
    },
    {
      "id": 272,
      "name": "أبو تيج"
    },
    {
      "id": 266,
      "name": "أسيوط"
    },
    {
      "id": 267,
      "name": "أسيوط الجديدة"
    },
    {
      "id": 275,
      "name": "البداري"
    },
    {
      "id": 273,
      "name": "الغنايم"
    },
    {
      "id": 270,
      "name": "القوصية"
    },
    {
      "id": 268,
      "name": "ديروط"
    },
    {
      "id": 274,
      "name": "ساحل سليم"
    },
    {
      "id": 276,
      "name": "صدفا"
    },
    {
      "id": 269,
      "name": "منفلوط"
    }
  ],

  3: [
    {
      "id": 93,
      "name": "ابو قير"
    },
    {
      "id": 95,
      "name": "الأزاريطة"
    },
    {
      "id": 94,
      "name": "الابراهيمية"
    },
    {
      "id": 96,
      "name": "الانفوشى"
    },
    {
      "id": 134,
      "name": "الجمرك"
    },
    {
      "id": 131,
      "name": "الحضرة"
    },
    {
      "id": 97,
      "name": "الدخيلة"
    },
    {
      "id": 130,
      "name": "الساحل الشمالي"
    },
    {
      "id": 98,
      "name": "السيوف"
    },
    {
      "id": 128,
      "name": "الشاطبي"
    },
    {
      "id": 99,
      "name": "العامرية"
    },
    {
      "id": 120,
      "name": "العجمي"
    },
    {
      "id": 119,
      "name": "العصافرة"
    },
    {
      "id": 132,
      "name": "العطارين"
    },
    {
      "id": 100,
      "name": "اللبان"
    },
    {
      "id": 125,
      "name": "المعمورة"
    },
    {
      "id": 101,
      "name": "المفروزة"
    },
    {
      "id": 135,
      "name": "المكس"
    },
    {
      "id": 102,
      "name": "المنتزه"
    },
    {
      "id": 126,
      "name": "المندرة"
    },
    {
      "id": 103,
      "name": "المنشية"
    },
    {
      "id": 104,
      "name": "الناصرية"
    },
    {
      "id": 105,
      "name": "امبروزو"
    },
    {
      "id": 106,
      "name": "باب شرق"
    },
    {
      "id": 107,
      "name": "برج العرب"
    },
    {
      "id": 121,
      "name": "بكوس"
    },
    {
      "id": 122,
      "name": "بولكلي"
    },
    {
      "id": 124,
      "name": "جليم"
    },
    {
      "id": 108,
      "name": "ستانلى"
    },
    {
      "id": 109,
      "name": "سموحة"
    },
    {
      "id": 110,
      "name": "سيدى بشر"
    },
    {
      "id": 129,
      "name": "سيدي جابر"
    },
    {
      "id": 133,
      "name": "سيدي كرير"
    },
    {
      "id": 111,
      "name": "شدس"
    },
    {
      "id": 112,
      "name": "غيط العنب"
    },
    {
      "id": 113,
      "name": "فلمينج"
    },
    {
      "id": 114,
      "name": "فيكتوريا"
    },
    {
      "id": 115,
      "name": "كامب شيزار"
    },
    {
      "id": 116,
      "name": "كرموز"
    },
    {
      "id": 123,
      "name": "كليوباترا"
    },
    {
      "id": 136,
      "name": "مارينا"
    },
    {
      "id": 127,
      "name": "محرم بك"
    },
    {
      "id": 117,
      "name": "محطة الرمل"
    },
    {
      "id": 118,
      "name": "مينا البصل"
    }
  ],

  23: [
    {
      "id": 349,
      "name": "الحمام"
    },
    {
      "id": 357,
      "name": "الساحل الشمالى"
    },
    {
      "id": 354,
      "name": "السلوم"
    },
    {
      "id": 351,
      "name": "الضبعة"
    },
    {
      "id": 350,
      "name": "العلمين"
    },
    {
      "id": 352,
      "name": "النجيلة"
    },
    {
      "id": 353,
      "name": "سيدي براني"
    },
    {
      "id": 355,
      "name": "سيوة"
    },
    {
      "id": 356,
      "name": "مارينا"
    },
    {
      "id": 348,
      "name": "مرسى مطروح"
    }
  ],

  4: [
    {
      "id": 141,
      "name": "أجا"
    },
    {
      "id": 148,
      "name": "الجمالية"
    },
    {
      "id": 143,
      "name": "السنبلاوين"
    },
    {
      "id": 144,
      "name": "الكردي"
    },
    {
      "id": 150,
      "name": "المطرية"
    },
    {
      "id": 146,
      "name": "المنزلة"
    },
    {
      "id": 137,
      "name": "المنصورة"
    },
    {
      "id": 151,
      "name": "بلقاس"
    },
    {
      "id": 145,
      "name": "بني عبيد"
    },
    {
      "id": 147,
      "name": "تمي الأمديد"
    },
    {
      "id": 153,
      "name": "جمصة"
    },
    {
      "id": 140,
      "name": "دكرنس"
    },
    {
      "id": 149,
      "name": "شربين"
    },
    {
      "id": 138,
      "name": "طلخا"
    },
    {
      "id": 154,
      "name": "محلة دمنة"
    },
    {
      "id": 142,
      "name": "منية النصر"
    },
    {
      "id": 152,
      "name": "ميت سلسيل"
    },
    {
      "id": 139,
      "name": "ميت غمر"
    },
    {
      "id": 155,
      "name": "نبروه"
    }
  ],

  5: [
    {
      "id": 163,
      "name": "الدهار"
    },
    {
      "id": 161,
      "name": "الشلاتين"
    },
    {
      "id": 156,
      "name": "الغردقة"
    },
    {
      "id": 159,
      "name": "القصير"
    },
    {
      "id": 162,
      "name": "حلايب"
    },
    {
      "id": 157,
      "name": "رأس غارب"
    },
    {
      "id": 158,
      "name": "سفاجا"
    },
    {
      "id": 160,
      "name": "مرسى علم"
    }
  ],

  6 : [
    {
      "id": 168,
      "name": "أبو المطامير"
    },
    {
      "id": 169,
      "name": "أبو حمص"
    },
    {
      "id": 167,
      "name": "إدكو"
    },
    {
      "id": 173,
      "name": "إيتاي البارود"
    },
    {
      "id": 170,
      "name": "الدلنجات"
    },
    {
      "id": 172,
      "name": "الرحمانية"
    },
    {
      "id": 171,
      "name": "المحمودية"
    },
    {
      "id": 180,
      "name": "النوبارية"
    },
    {
      "id": 179,
      "name": "النوبارية الجديدة"
    },
    {
      "id": 177,
      "name": "بدر"
    },
    {
      "id": 174,
      "name": "حوش عيسى"
    },
    {
      "id": 164,
      "name": "دمنهور"
    },
    {
      "id": 166,
      "name": "رشيد"
    },
    {
      "id": 175,
      "name": "شبراخيت"
    },
    {
      "id": 165,
      "name": "كفر الدوار"
    },
    {
      "id": 176,
      "name": "كوم حمادة"
    },
    {
      "id": 178,
      "name": "وادي النطرون"
    }
  ],

  7: [
    {
      "id": 186,
      "name": "إبشواي"
    },
    {
      "id": 185,
      "name": "إطسا"
    },
    {
      "id": 189,
      "name": "اطسا"
    },
    {
      "id": 190,
      "name": "الجامعة"
    },
    {
      "id": 188,
      "name": "الحادقة"
    },
    {
      "id": 191,
      "name": "السيالة"
    },
    {
      "id": 181,
      "name": "الفيوم"
    },
    {
      "id": 182,
      "name": "الفيوم الجديدة"
    },
    {
      "id": 184,
      "name": "سنورس"
    },
    {
      "id": 183,
      "name": "طامية"
    },
    {
      "id": 187,
      "name": "يوسف الصديق"
    }
  ],

  8: [
    {
      "id": 196,
      "name": "السنطة"
    },
    {
      "id": 193,
      "name": "المحلة الكبرى"
    },
    {
      "id": 198,
      "name": "بسيون"
    },
    {
      "id": 195,
      "name": "زفتى"
    },
    {
      "id": 199,
      "name": "سمنود"
    },
    {
      "id": 192,
      "name": "طنطا"
    },
    {
      "id": 197,
      "name": "قطور"
    },
    {
      "id": 194,
      "name": "كفر الزيات"
    }
  ],

  9: [
    {
      "id": 205,
      "name": "أبو صوير"
    },
    {
      "id": 200,
      "name": "الإسماعيلية"
    },
    {
      "id": 204,
      "name": "التل الكبير"
    },
    {
      "id": 208,
      "name": "الشيخ زايد"
    },
    {
      "id": 206,
      "name": "القصاصين الجديدة"
    },
    {
      "id": 202,
      "name": "القنطرة شرق"
    },
    {
      "id": 203,
      "name": "القنطرة غرب"
    },
    {
      "id": 201,
      "name": "فايد"
    },
    {
      "id": 207,
      "name": "نفيشة"
    }
  ],

  10: [
    {
      "id": 213,
      "name": "أشمون"
    },
    {
      "id": 214,
      "name": "الباجور"
    },
    {
      "id": 218,
      "name": "الشهداء"
    },
    {
      "id": 216,
      "name": "بركة السبع"
    },
    {
      "id": 217,
      "name": "تلا"
    },
    {
      "id": 212,
      "name": "سرس الليان"
    },
    {
      "id": 209,
      "name": "شبين الكوم"
    },
    {
      "id": 215,
      "name": "قويسنا"
    },
    {
      "id": 210,
      "name": "مدينة السادات"
    },
    {
      "id": 211,
      "name": "منوف"
    }
  ],

  11:  [
    {
      "id": 229,
      "name": "ابو قرقاص"
    },
    {
      "id": 230,
      "name": "ارض سلطان"
    },
    {
      "id": 221,
      "name": "العدوة"
    },
    {
      "id": 226,
      "name": "المدينة الفكرية"
    },
    {
      "id": 219,
      "name": "المنيا"
    },
    {
      "id": 220,
      "name": "المنيا الجديدة"
    },
    {
      "id": 223,
      "name": "بني مزار"
    },
    {
      "id": 228,
      "name": "دير مواس"
    },
    {
      "id": 225,
      "name": "سمالوط"
    },
    {
      "id": 224,
      "name": "مطاي"
    },
    {
      "id": 222,
      "name": "مغاغة"
    },
    {
      "id": 227,
      "name": "ملوي"
    }
  ],

  12: [
    {
      "id": 235,
      "name": "الخانكة"
    },
    {
      "id": 240,
      "name": "الخصوص"
    },
    {
      "id": 239,
      "name": "العبور"
    },
    {
      "id": 234,
      "name": "القناطر الخيرية"
    },
    {
      "id": 231,
      "name": "بنها"
    },
    {
      "id": 233,
      "name": "شبرا الخيمة"
    },
    {
      "id": 241,
      "name": "شبين القناطر"
    },
    {
      "id": 237,
      "name": "طوخ"
    },
    {
      "id": 232,
      "name": "قليوب"
    },
    {
      "id": 238,
      "name": "قها"
    },
    {
      "id": 236,
      "name": "كفر شكر"
    },
    {
      "id": 242,
      "name": "مسطرد"
    }
  ],

  13: [
    {
      "id": 243,
      "name": "الخارجة"
    },
    {
      "id": 248,
      "name": "الداخلة"
    },
    {
      "id": 246,
      "name": "الفرافرة"
    },
    {
      "id": 244,
      "name": "باريس"
    },
    {
      "id": 247,
      "name": "بلاط"
    },
    {
      "id": 245,
      "name": "موط"
    }
  ],

  14: [
    {
      "id": 250,
      "name": "الجناين"
    },
    {
      "id": 249,
      "name": "السويس"
    },
    {
      "id": 252,
      "name": "العين السخنة"
    },
    {
      "id": 251,
      "name": "عتاقة"
    },
    {
      "id": 253,
      "name": "فيصل"
    }
  ],

  17: [
    {
      "id": 281,
      "name": "إهناسيا"
    },
    {
      "id": 285,
      "name": "الاباصيرى"
    },
    {
      "id": 283,
      "name": "الفشن"
    },
    {
      "id": 279,
      "name": "الواسطى"
    },
    {
      "id": 282,
      "name": "ببا"
    },
    {
      "id": 277,
      "name": "بني سويف"
    },
    {
      "id": 278,
      "name": "بني سويف الجديدة"
    },
    {
      "id": 284,
      "name": "سمسطا"
    },
    {
      "id": 286,
      "name": "مقبل"
    },
    {
      "id": 280,
      "name": "ناصر"
    }
  ],

  18: [
    {
      "id": 289,
      "name": "العرب"
    },
    {
      "id": 287,
      "name": "بورسعيد"
    },
    {
      "id": 288,
      "name": "بورفؤاد"
    },
    {
      "id": 290,
      "name": "حى الزهور"
    },
    {
      "id": 291,
      "name": "حى الشرق"
    },
    {
      "id": 292,
      "name": "حى الضواحى"
    },
    {
      "id": 293,
      "name": "حى المناخ"
    },
    {
      "id": 294,
      "name": "حى مبارك"
    }
  ],

  19: [
    {
      "id": 301,
      "name": "الروضة"
    },
    {
      "id": 299,
      "name": "الزرقا"
    },
    {
      "id": 300,
      "name": "السرو"
    },
    {
      "id": 295,
      "name": "دمياط"
    },
    {
      "id": 296,
      "name": "دمياط الجديدة"
    },
    {
      "id": 297,
      "name": "رأس البر"
    },
    {
      "id": 303,
      "name": "عزبة البرج"
    },
    {
      "id": 298,
      "name": "فارسكور"
    },
    {
      "id": 302,
      "name": "كفر البطيخ"
    },
    {
      "id": 305,
      "name": "كفر سعد"
    },
    {
      "id": 304,
      "name": "ميت أبو غالب"
    }
  ],

  20: [
    {
      "id": 312,
      "name": "أبو حماد"
    },
    {
      "id": 315,
      "name": "أبو كبير"
    },
    {
      "id": 321,
      "name": "أولاد صقر"
    },
    {
      "id": 318,
      "name": "الإبراهيمية"
    },
    {
      "id": 322,
      "name": "الحسينية"
    },
    {
      "id": 306,
      "name": "الزقازيق"
    },
    {
      "id": 317,
      "name": "الصالحية الجديدة"
    },
    {
      "id": 307,
      "name": "العاشر من رمضان"
    },
    {
      "id": 313,
      "name": "القرين"
    },
    {
      "id": 311,
      "name": "القنايات"
    },
    {
      "id": 309,
      "name": "بلبيس"
    },
    {
      "id": 319,
      "name": "ديرب نجم"
    },
    {
      "id": 323,
      "name": "صان الحجر القبلية"
    },
    {
      "id": 316,
      "name": "فاقوس"
    },
    {
      "id": 320,
      "name": "كفر صقر"
    },
    {
      "id": 310,
      "name": "مشتول السوق"
    },
    {
      "id": 324,
      "name": "منشأة أبو عمر"
    },
    {
      "id": 308,
      "name": "منيا القمح"
    },
    {
      "id": 314,
      "name": "ههيا"
    }
  ],

  21: [
    {
      "id": 331,
      "name": "أبو رديس"
    },
    {
      "id": 332,
      "name": "أبو زنيمة"
    },
    {
      "id": 325,
      "name": "الطور"
    },
    {
      "id": 327,
      "name": "دهب"
    },
    {
      "id": 333,
      "name": "رأس سدر"
    },
    {
      "id": 330,
      "name": "سانت كاترين"
    },
    {
      "id": 326,
      "name": "شرم الشيخ"
    },
    {
      "id": 329,
      "name": "طابا"
    },
    {
      "id": 328,
      "name": "نويبع"
    }
  ],

  22: [
    {
      "id": 342,
      "name": "الحامول"
    },
    {
      "id": 344,
      "name": "الرياض"
    },
    {
      "id": 339,
      "name": "برج البرلس"
    },
    {
      "id": 340,
      "name": "بلطيم"
    },
    {
      "id": 343,
      "name": "بيلا"
    },
    {
      "id": 336,
      "name": "دسوق"
    },
    {
      "id": 345,
      "name": "سيدي سالم"
    },
    {
      "id": 347,
      "name": "سيدي غازي"
    },
    {
      "id": 337,
      "name": "فوه"
    },
    {
      "id": 346,
      "name": "قلين"
    },
    {
      "id": 334,
      "name": "كفر الشيخ"
    },
    {
      "id": 341,
      "name": "مصيف بلطيم"
    },
    {
      "id": 338,
      "name": "مطوبس"
    },
    {
      "id": 335,
      "name": "وسط البلد كفر الشيخ"
    }
  ],

  24: [
    {
      "id": 365,
      "name": "أرمنت"
    },
    {
      "id": 360,
      "name": "إسنا"
    },
    {
      "id": 358,
      "name": "الأقصر"
    },
    {
      "id": 359,
      "name": "الأقصر الجديدة"
    },
    {
      "id": 363,
      "name": "البياضية"
    },
    {
      "id": 362,
      "name": "الزينية"
    },
    {
      "id": 366,
      "name": "الطود"
    },
    {
      "id": 364,
      "name": "القرنة"
    },
    {
      "id": 361,
      "name": "طيبة الجديدة"
    }
  ],

  25: [
    {
      "id": 369,
      "name": "ابو طشت"
    },
    {
      "id": 372,
      "name": "الوقف"
    },
    {
      "id": 371,
      "name": "دشنا"
    },
    {
      "id": 375,
      "name": "فرشوط"
    },
    {
      "id": 373,
      "name": "قفط"
    },
    {
      "id": 367,
      "name": "قنا"
    },
    {
      "id": 368,
      "name": "قنا الجديدة"
    },
    {
      "id": 376,
      "name": "قوص"
    },
    {
      "id": 370,
      "name": "نجع حمادي"
    },
    {
      "id": 374,
      "name": "نقادة"
    }
  ],

  26: [
    {
      "id": 382,
      "name": "الحسنة"
    },
    {
      "id": 378,
      "name": "الشيخ زويد"
    },
    {
      "id": 377,
      "name": "العريش"
    },
    {
      "id": 381,
      "name": "بئر العبد"
    },
    {
      "id": 380,
      "name": "رفح"
    },
    {
      "id": 379,
      "name": "نخل"
    }
  ],

  27: [
    {
      "id": 385,
      "name": "أخميم"
    },
    {
      "id": 386,
      "name": "أخميم الجديدة"
    },
    {
      "id": 387,
      "name": "البلينا"
    },
    {
      "id": 396,
      "name": "الكوثر"
    },
    {
      "id": 388,
      "name": "المراغة"
    },
    {
      "id": 389,
      "name": "المنشأة"
    },
    {
      "id": 391,
      "name": "جرجا"
    },
    {
      "id": 392,
      "name": "جهينة الغربية"
    },
    {
      "id": 390,
      "name": "دار السلام"
    },
    {
      "id": 393,
      "name": "ساقلته"
    },
    {
      "id": 383,
      "name": "سوهاج"
    },
    {
      "id": 384,
      "name": "سوهاج الجديدة"
    },
    {
      "id": 394,
      "name": "طما"
    },
    {
      "id": 395,
      "name": "طهطا"
    }
  ],
};